{
    "blog": {
        "recent": [
            {
                "title": "Let's Watch: White Zombie",
                "date": "2017-05-07 14:20:00",
                "excerpt": null,
                "description": "Two things I enjoy are folklore and zombies. Oddly in spite of the latter I've never been much of a movie fan; being deaf means I'm obliged to use subtitles and since I'm reading anyway, why not just read a book? But I am interested in the origins of the zombies we know and love today, so since it's Zombie Awareness Month, I've decided to embark on a journey of cinematic discovery, if you will, a zomboddysey, of the zombie canon in cinematic history. So let's watch White Zombie!",
                "slug": "lets-watch-white-zombie"
            },
            {
                "title": "Using actions in Pa11y",
                "date": "2017-03-12 14:20:00",
                "excerpt": null,
                "description": "We recently released Actions for Pa11y and Pa11y Dashboard. This post explores the reasons behind the change, and how to put it to use in your projects right now. ",
                "slug": "using-actions-in-pa11y"
            },
            {
                "title": "On being a deaf developer and deep accessibility",
                "date": "2016-01-18 13:40",
                "excerpt": "&ldquo;The power of the Web is in its universality. Access by everyone regardless of disability is an essential aspect.&rdquo;  - Tim Berners-Lee, inventor of the World Wide Web",
                "description": "Accessibility as a philosophy of problem-solving for everyone",
                "slug": "being-a-deaf-developer"
            },
            {
                "title": "Setting up Vagrant boxes for web development",
                "date": "2014-02-27 00:00",
                "excerpt": null,
                "description": null,
                "slug": "setting-up-vagrant-boxes-for-web-development"
            },
            {
                "title": "Why I switched to Susy",
                "date": "2013-04-13 15:57:41",
                "excerpt": null,
                "description": "Tl;dr: because everything else pretty much sucks",
                "slug": "why-i-switched-to-susy"
            },
            {
                "title": "The London Classic 2013",
                "date": "2013-04-08 15:40:21",
                "excerpt": null,
                "description": "The Heaven of the South",
                "slug": "the-london-classic-2013"
            }
        ],
        "feature": {
            "title": "Let's Watch: Revolt of the Zombies",
            "date": "2017-05-08 21:44:00",
            "excerpt": null,
            "description": "Two things I enjoy are folklore and zombies. Oddly in spite of the latter I've never been much of a movie fan; being deaf means I'm obliged to use subtitles and since I'm reading anyway, why not just read a book? But I am interested in the origins of the zombies we know and love today, so since it's Zombie Awareness Month, I've decided to embark on a journey of cinematic discovery, if you will, a zomboddysey, of the zombie canon in cinematic history. So let's watch Revolt of the Zombies!",
            "slug": "lets-watch-revolt-of-the-zombies"
        }
    }
}