{
    "filecreated": "2017-05-11",
    "metadata": {
        "title": "Let's Watch: King of the Zombies",
        "description": "Two things I enjoy are folklore and zombies. Oddly in spite of the latter I've never been much of a movie fan; being deaf means I'm obliged to use subtitles and since I'm reading anyway, why not just read a book? But I am interested in the origins of the zombies we know and love today, so since it's Zombie Awareness Month, I've decided to embark on a journey of cinematic discovery, if you will, a zomboddysey, of the zombie canon in cinematic history. So let's watch King of the Zombies!",
        "date": "2017-05-11 21:30:00",
        "lastmod": "2017-05-11 21:30:00"
    },
    "slug": "lets-watch-king-of-the-zombies",
    "content": "<p>If you thought <a href=\"\/posts\/lets-watch-ghost-breakers\"><em>The Ghost Breakers<\/em><\/a> was a bit too racially-charged for you to comfortably get along with, you're probably really gonna struggle with this one. Supposedly headlined by white actors Dick Purcell and Joan Woodbury, the star of the show is actually the prolific black comedy actor Mantan Moreland. Here, he's playing more or less the same role that Willie Best did in <em>Ghost Breakers<\/em> - the <a href=\"http:\/\/www.blackhorrormovies.com\/types\/\">black manservant who's scared of everything<\/a>. Like Best, he does get all the good lines. Unlike Best's role, there's no attempt at approaching parity between the black and white characters, which makes for some toe-curling scenes that throw the reality of life under Jim Crow into the spotlight. It may, I think, be an error to see this as unconscious casual racism that accidentally crept into the film; Moreland's quietly comic handling of the scenes where he's mistreated by the white cast are archly self-aware.<\/p>\n\n<p>The story isn't going to win any prizes for originality. The creepy Dr. Sangre is a Bela Lugosi-esque sorcerer type whose hobby is using mesmerism to subdue the natives by turning them all into zombies (as in <a href=\"\/posts\/lets-watch-white-zombie\">White Zombie<\/a>, <a href=\"\/posts\/lets-watch-revolt-of-the-zombies\">Revolt of the Zombies<\/a>). There's a zombified woman dressed in white with minimal spoken lines (as in White Zombie). There's an \"Irishman\" with an inexplicably American accent (as in Revolt of the zombies). There's a spooky voodoo lady (as in <a href=\"\/posts\/lets-watch-ouanga-and-devils-daughter\">Ouanga, The Devil's Daughter<\/a>, The Ghost Breakers). There's a flirty romance between the black comic relief characters (as in Ouanga, The Devil's Daughter). The black guy is afraid of everything (as in Ouanga, Devil's Daughter, Ghost Breakers)...<\/p>\n\n<p>So, pretty much everything in this movie is stuff we've already seen, except for the degree of ubiquitous, overt racism. In spite of this, the film ends up being carried along by its black cast, the only actors here with the ability to act. Marguerite Whitten as the maid Samantha plays an excellent comic foil to Moreland's Jeff, and the pair are great fun to watch together.<\/p>\n\n<p>The zombies here are of the alive-but-hypnotised flavour, but it's notable that in this movie the suggestion is twice made that they're <em>hungry for human flesh!<\/em>, something that we haven't really seen up until now. This is also the first outing of the venerable B-movie institution of the Nazi Zombie, although the Nazis aren't billed as such, and there's still a long way to go before we get to <em>Shock Waves<\/em> or <em>Död Snö<\/em>.<\/p>\n\n<p>The movie gets very good reviews elsewhere, but I didn't find it as enjoyable as The Ghost Breakers; although Moreland and Whitten are the bright spots, the rest of the cast are dismally uninspiring. Nor is it as nearly as well-executed as White Zombie, clearly a major inspiration.<\/p>\n\n<p>The film is public domain, and there are several versions on Youtube. I watched <a href=\"https:\/\/www.youtube.com\/watch?v=m7_gZjyOQdM\">this version<\/a>. There are no English subtitles available except for Google automatic captions, but there are French subtitles available on <a href=\"https:\/\/www.opensubtitles.org\/en\/subtitles\/5175007\/king-of-the-zombies-fr\">OpenSubtitles<\/a>.<\/p>\n\n<p>I give this derivative mixed bag 2 salted zombie snacks out of a possible 5!<\/p>\n\n<div class=\"zombie-stars two-of-five\">2 \/ 5<\/div>\n",
    "title": "Let's Watch: King of the Zombies - hollsk.co.uk",
    "layout": {
        "template": "post"
    },
    "blog": {
        "recent": [
            {
                "title": "Let's Watch: The Ghost Breakers",
                "date": "2017-05-10 23:00:00",
                "excerpt": null,
                "description": "Two things I enjoy are folklore and zombies. Oddly in spite of the latter I've never been much of a movie fan; being deaf means I'm obliged to use subtitles and since I'm reading anyway, why not just read a book? But I am interested in the origins of the zombies we know and love today, so since it's Zombie Awareness Month, I've decided to embark on a journey of cinematic discovery, if you will, a zomboddysey, of the zombie canon in cinematic history. So let's watch The Ghost Breakers!",
                "slug": "lets-watch-ghost-breakers"
            },
            {
                "title": "Let's Watch: Ouanga and The Devil's Daughter",
                "date": "2017-05-09 22:44:00",
                "excerpt": null,
                "description": "Two things I enjoy are folklore and zombies. Oddly in spite of the latter I've never been much of a movie fan; being deaf means I'm obliged to use subtitles and since I'm reading anyway, why not just read a book? But I am interested in the origins of the zombies we know and love today, so since it's Zombie Awareness Month, I've decided to embark on a journey of cinematic discovery, if you will, a zomboddysey, of the zombie canon in cinematic history. So let's watch Ouanga and The Devil's Daughter!",
                "slug": "lets-watch-ouanga-and-devils-daughter"
            },
            {
                "title": "Let's Watch: Revolt of the Zombies",
                "date": "2017-05-08 21:44:00",
                "excerpt": null,
                "description": "Two things I enjoy are folklore and zombies. Oddly in spite of the latter I've never been much of a movie fan; being deaf means I'm obliged to use subtitles and since I'm reading anyway, why not just read a book? But I am interested in the origins of the zombies we know and love today, so since it's Zombie Awareness Month, I've decided to embark on a journey of cinematic discovery, if you will, a zomboddysey, of the zombie canon in cinematic history. So let's watch Revolt of the Zombies!",
                "slug": "lets-watch-revolt-of-the-zombies"
            },
            {
                "title": "Let's Watch: White Zombie",
                "date": "2017-05-07 14:20:00",
                "excerpt": null,
                "description": "Two things I enjoy are folklore and zombies. Oddly in spite of the latter I've never been much of a movie fan; being deaf means I'm obliged to use subtitles and since I'm reading anyway, why not just read a book? But I am interested in the origins of the zombies we know and love today, so since it's Zombie Awareness Month, I've decided to embark on a journey of cinematic discovery, if you will, a zomboddysey, of the zombie canon in cinematic history. So let's watch White Zombie!",
                "slug": "lets-watch-white-zombie"
            },
            {
                "title": "Using actions in Pa11y",
                "date": "2017-03-12 14:20:00",
                "excerpt": null,
                "description": "We recently released Actions for Pa11y and Pa11y Dashboard. This post explores the reasons behind the change, and how to put it to use in your projects right now. ",
                "slug": "using-actions-in-pa11y"
            },
            {
                "title": "On being a deaf developer and deep accessibility",
                "date": "2016-01-18 13:40",
                "excerpt": "&ldquo;The power of the Web is in its universality. Access by everyone regardless of disability is an essential aspect.&rdquo;  - Tim Berners-Lee, inventor of the World Wide Web",
                "description": "Accessibility as a philosophy of problem-solving for everyone",
                "slug": "being-a-deaf-developer"
            }
        ]
    }
}