{
    "filecreated": "2017-05-07",
    "metadata": {
        "title": "Let's Watch: White Zombie",
        "description": "Two things I enjoy are folklore and zombies. Oddly in spite of the latter I've never been much of a movie fan; being deaf means I'm obliged to use subtitles and since I'm reading anyway, why not just read a book? But I am interested in the origins of the zombies we know and love today, so since it's Zombie Awareness Month, I've decided to embark on a journey of cinematic discovery, if you will, a zomboddysey, of the zombie canon in cinematic history. So let's watch White Zombie!",
        "date": "2017-05-07 14:20:00",
        "lastmod": "2017-05-07 14:20:00"
    },
    "slug": "lets-watch-white-zombie",
    "content": "<blockquote>\n  <p>“The eyes were the worst. It was not my imagination. They were in truth like the eyes of a dead man, not blind, but staring, unfocused, unseeing. The whole face, for that matter, was bad enough. It was vacant, as if there was nothing behind it. It seemed not only expressionless, but incapable of expression.”<br \/>\n  <em>Magic Island<\/em>, W. Seabrook<\/p>\n<\/blockquote>\n\n<p><em>White Zombie<\/em> (1932) is regarded as the first zombie movie in cinematic history, and it's the one that directors Victor and Edward Halperin are probably best known for. It was a surprise hit at the box office despite critics dismissing it at the time as \"childish, old-fashioned and melodramatic.\" They weren't wrong. The screenplay by Garnett Weston was inspired by William B Seabrook’s 1929 book, <a href=\"https:\/\/www.amazon.co.uk\/Magic-Island-William-Seabrook\/dp\/048679962X\"><em>The Magic Island<\/em><\/a>, a \"best and most thrilling book of exploration\", and the book that first introduced the concept of zombies to the West. Seabrook is quite an interesting fellow in his own right - an American occultist and decorated war hero who once associated with Aleister Crowley and who - after stealing some prime cuts of long pork from a Parisian hospital - dabbled in a bit of Actual Cannibalism. Tastes \"like good, fully developed veal\", apparently.<\/p>\n\n<p>Garnett Weston also appeared to take inspiration from a 3 act Broadway play called <em>Zombie<\/em> by Kenneth Webb, caustically reviewed by <em>Time<\/em> in 1932:<\/p>\n\n<blockquote>\n  <p>Mr. William Seabrook’s romantic fibs about far-off places do no one any harm, and have certainly not harmed Zombie, whose playwright (Kenneth Webb) seems to have read author Seabrook’s The Magic Island... For the most part wretchedly acted (including the work of Miss Pauline Starke, deep-voiced one-time film actress) and beset with deplorably written dialog...<br \/>\n  “Theatre: New Plays in Manhattan: Feb. 22, 1932”<br \/>\n  <a href=\"http:\/\/content.time.com\/time\/magazine\/article\/0,9171,743239-1,00.html\"><em>Time Magazine<\/em><\/a><\/p>\n<\/blockquote>\n\n<p>The film opened in March 1929, just one month after the play's Broadway debut, and Kenneth Webb promptly sued the brothers Halperin for infringement. Luckily for them, they won the case. The play was only performed 21 times, and the manuscript unfortunately seems to be lost to time, so the full extent of any plagairism may never be known.<\/p>\n\n<p>As for the movie itself; at only 73 minutes long, it is worth watching. Is it good? Jesus Christ, no, of course it isn't. With the exception of the always-good-value Béla Lugosi as creepy magician \"Murder Legendre\" (no, really), the acting and dialogue truly is dreadful stuff; I mean to say: \"I thought that beauty alone would satisfy. But the soul is gone. I can't bear those empty, staring eyes.\"<\/p>\n\n<p>The basic plot is that Madeline and Neil, due to be married, have been offered the home of one Monsieur Beaumont, a plantation owner in Haiti, in which to perform the service. Beaumont, having only met them once or twice, isn't offering this out of the kindness of his heart - he has fallen in love with Madeline and like some kind of pre-war PUA, has decided to wrestle this prize possession from Neil's grasp by whatever means necessary.<\/p>\n\n<p>Off he goes to the fabulously evil sorcerer Murder Legendre who tells him straight up that he's pissing in the wind. Legendre does have a trick up his sleeve though, and hands Beaumont a vial of deadening brew for him to administer to the luckless Madeline if she can't be persuaded to see things his way. But first he extracts a promise of a <em>heavy cost<\/em>...<\/p>\n\n<p>Beaumont escorts Mads to the nuptial hall and makes a very weak effort at persuading her to forget all this wedding nonsense. She tells him where to get off. He gives her a flower spiked with the Zombie Formula 3000. Wedding proceeds. At the meal, Mads keels over and dies.<\/p>\n\n<p>But of course, she's just been put in a metabolically inactive state by Legendre's potion, which allows her \"corpse\" to be carted out of its tomb as soon as the coast is clear. She's taken back to Murder's mountain lair by his pet zombies and transformed into Beaumont's dead-eyed love slave. He realises fairly quickly that it's not nearly as much fun as he thought it would be (she's very boring now, you see), and demands Legendre fix it. Legendre fixes it by zombifying Beaumont too.<\/p>\n\n<p>Meanwhile Bruner, the local missionary and expert in Haitian law, has speculated that the vanished Madeline wasn't dead at all. Perhaps she has instead been put to sleep and then taken away by the natives. “In the hands of the natives!?” cries Neil in horreur. “Better dead than that!”. Lordy. Bruner and Neil head off to the mountain lair to save Madeline, Beaumont has a crisis of conscience and Legendre gets his comeuppance.<\/p>\n\n<p>Character-wise, the winsome Madeline is undeveloped either as a character or as a human being, just a tabula rasa of sorts onto which the male characters project their own desires. Neil is not much better. I was very puzzled during the scene where Beaumont escorts Madeline to the aisle, imploring her not to enter the room, and bemoaning that he was about to lose her forever. \"What a strange speech to give your wife-to-be right before you marry her?\", I thought. It wasn't until several minutes later I recalled that in fact she was supposed to be marrying <em>Neil<\/em>, not Beaumont, and that the two gents were so indistinguishable that I couldn't tell them apart.<\/p>\n\n<p>After Madeline's damselling-in-the-refrigerator, it is somewhat amusing to see Neil fall into the damsel role himself (swooning faints and all) while attempting to rescue her, and having to be lugged around by Bruner. The genuinely interesting relationship in the film is that between Beaumont and Legendre, as Beaumont realises that his Faustian bargain is catching up with him, while Legendre treats his latest acquisition with a kind of twisted, fatherly affection.<\/p>\n\n<p>Although the acting is stiffer than a day-old corpse and the dialogue laughably weak, there are some strikingly good things about the movie. Lugosi's performance, as already noted, is excellent, and the almost dreamlike visual style is a masterpiece of interplay between light and dark. The brothers Halperin were ambivalent towards sound in pictures, both being directors of some success during the silent era. For <em>White Zombie<\/em> they had made the deliberate decision to treat the film like a silent picture, to carry it along with the strength of its visuals. This is why the film was seen as so old-fashioned, even back in 1932 - talking pictures had been the defacto standard for around 5 years at this point, so the (mercifully) minimal dialogue and over-acted theatrical style seemed absurdly anachronistic. The Halperins did make good use of atmospheric music and sound effects (relatively uncommon at the time); the combination of sound and visual makes the scene where Beaumont visits Legendre's sugar mill still very creepy even today. There's a part where one of the zombies falls into the mill blades that wouldn't be out of place in a zombie flick today. The black and white costume design, too, speaks of a visually-arresting symbolic battle between the forces of darkness and purity.<\/p>\n\n<p>The film is public domain, and there are several versions on Youtube. I watched <a href=\"https:\/\/www.youtube.com\/watch?v=lQ0hL4EBC58\">this version<\/a> with the help of Open Subtitles and the Subtitles for Youtube extension.<\/p>\n\n<p>I give this minor classic masterpiece 3 ouangas out of a possible 5!<\/p>\n\n<div class=\"zombie-stars three-of-five\">3 \/ 5<\/div>\n",
    "title": "Let's Watch: White Zombie - hollsk.co.uk",
    "layout": {
        "template": "post"
    },
    "blog": {
        "recent": [
            {
                "title": "Using actions in Pa11y",
                "date": "2017-03-12 14:20:00",
                "excerpt": null,
                "description": "We recently released Actions for Pa11y and Pa11y Dashboard. This post explores the reasons behind the change, and how to put it to use in your projects right now. ",
                "slug": "using-actions-in-pa11y"
            },
            {
                "title": "On being a deaf developer and deep accessibility",
                "date": "2016-01-18 13:40",
                "excerpt": "&ldquo;The power of the Web is in its universality. Access by everyone regardless of disability is an essential aspect.&rdquo;  - Tim Berners-Lee, inventor of the World Wide Web",
                "description": "Accessibility as a philosophy of problem-solving for everyone",
                "slug": "being-a-deaf-developer"
            },
            {
                "title": "Setting up Vagrant boxes for web development",
                "date": "2014-02-27 00:00",
                "excerpt": null,
                "description": null,
                "slug": "setting-up-vagrant-boxes-for-web-development"
            },
            {
                "title": "Why I switched to Susy",
                "date": "2013-04-13 15:57:41",
                "excerpt": null,
                "description": "Tl;dr: because everything else pretty much sucks",
                "slug": "why-i-switched-to-susy"
            },
            {
                "title": "The London Classic 2013",
                "date": "2013-04-08 15:40:21",
                "excerpt": null,
                "description": "The Heaven of the South",
                "slug": "the-london-classic-2013"
            },
            {
                "title": "London - Bletchley 23\/06\/2012",
                "date": "2012-06-28 02:35:30",
                "excerpt": null,
                "description": null,
                "slug": "london-bletchley-23-06-2012"
            }
        ]
    }
}