{
    "filecreated": "2017-05-08",
    "metadata": {
        "title": "Let's Watch: Revolt of the Zombies",
        "description": "Two things I enjoy are folklore and zombies. Oddly in spite of the latter I've never been much of a movie fan; being deaf means I'm obliged to use subtitles and since I'm reading anyway, why not just read a book? But I am interested in the origins of the zombies we know and love today, so since it's Zombie Awareness Month, I've decided to embark on a journey of cinematic discovery, if you will, a zomboddysey, of the zombie canon in cinematic history. So let's watch Revolt of the Zombies!",
        "date": "2017-05-08 21:44:00",
        "lastmod": "2017-05-08 21:44:00"
    },
    "slug": "lets-watch-revolt-of-the-zombies",
    "content": "<blockquote>\n  <p>Who the gods destroy, they first make mad.<\/p>\n<\/blockquote>\n\n<p>Dear lord, where even to begin with this. A sequel of sorts to <a href=\"\/posts\/lets-watch-white-zombie\"><em>White Zombie<\/em><\/a> (thematically, if not in terms of plot), after making this movie, Victor Halperin gave up horror for good - \"I don't believe in fear, violence, and horror, so why traffic in them?\".<\/p>\n\n<p>Cinematically, you'd never guess this thing was a successor to <em>White Zombie<\/em> - it has none of the artistic virtuosity or sense of space and atmosphere. The expansive, chiaroscuro-like sets are gone, replaced with cramped little rooms with ropey backdrops. The acting is probably on par with the previous film, which is not a good thing.<\/p>\n\n<p>On the Franco-Austrian(?) border during the First World War, an \"oriental priest\" is the chaplain of a French regiment. He's also the last living descendent of a line of ancient Cambodian Priest-Kings with the knowledge of enthralling human beings to be bent to their will. His \"gods say that he must create zombie soldiers\"(?), and offers these to the French to help them win the war. Interpreter Armand Louque tries his best to persuade General Duval of the veracity of the priest's claims and is given short shrift, so our priest puts on a little demonstration of how a handful of his unkillable \"robots\" can take out an entire trench filled with well-armed Prussians.<\/p>\n\n<p>The General, now convinced, calls his German counterpart into his office(?) to discuss the matter. Since having unstoppable Cambodian zombies running around in French-occupied Cambodia \"might mean the end of the white race!\"(?) the Generals have the last high priest of this noble ancient lineage clapped in irons, where he's later murdered by Duval's second-in-command General Mazovia.<\/p>\n\n<p>Expressing surprise and regret at how the prisoner could possibly have died under his watch, Gen. Duval sends every character in the entire film (including the <em>obviously<\/em> evil Gen. Mazovia) out to the mystical backdrop of Angkor so that they can learn the secret for themselves and destroy it(?). There is a terrible, horrible, no good, very bad love triangle woven into this, featuring Armand, his best buddy Cliff, and the General's awful daughter Claire.<\/p>\n\n<p>Cliff and Armand are both in love with Claire, and Claire agrees to marry both of them (on separate occasions, not simultaneously), to make one jealous and... oh, I don't know. It's the worst kind of contrived romance caper. Despite this passionate love triangle, there's as much visible chemistry between any of the three as there is between the contents of a bag of room-temperature chicken giblets. Just like with <em>White Zombie<\/em> I struggled to keep track of which of the men was supposed to be the groom. Whatever.<\/p>\n\n<p>Anyway, they get to the backdropped lands of Angkor Wat, and Armand has a meltdown because dreadful Claire has dropped him for irritating Cliff. In a rage, he figures out where the zombie secret is hidden, heads to its hiding place and steals it, and then zombifies everyone in the expedition to persuade Claire to love him(?). Predictably, it doesn't work. To prove his love(?) he then releases all his erstwhile zombified charges. They storm the building at Sunday stroll pace and shoot him once, right in the guts, finishing this awful ordeal for us all.<\/p>\n\n<p>Structurally, this is a very strange film that doesn't really seem to know what it wants to be. It's a romantic melodrama, yes, but it's also got robot war zombies in. It wants to tell a moral story about how you shouldn't let your ambitions consume you, but it also wants to transpose Haitian bokor magic into WW1 Cambodia(?)<\/p>\n\n<p>The \"zombification\" itself is something of an odd beast. Similar to White Zombie, the main method of control seems to be telepathy (hilariously indicated by superimposing shots of Bela Lugosi's eyes from the earlier movie onto any scene requiring spooky stuff to happen). One thing I wasn't able to figure out is why Armand needed to use magic smokepowder to enslave his first zombie, but was able to bring every other person in the film under his control in seconds, without even being within shouting distance of them.<\/p>\n\n<p>Lugosi's eyes and the idea of mesmerism as zombie control aren't the only things reused from the previous movie - there's also a moment when Armand harks back to Legendre's lines about what would happen if he ever lost control; \"they would tear me to pieces... but <em>that<\/em>... shall never be.\"<\/p>\n\n<p>All this said, it's not quite as bad as its reputation suggests. I mean, it is very bad, undoubtedly. But it doesn't necessarily deserve the kicking it gets from horror fans, and we'll be watching much worse shortly.<\/p>\n\n<p>The film is public domain, and there are several versions on Youtube. I watched <a href=\"https:\/\/www.youtube.com\/watch?v=ygfTft8yQVQ\">this version<\/a>. There are no subtitles available, but there are some in progress at <a href=\"http:\/\/amara.org\/en\/videos\/w5hYYEhnbYA1\/info\/revolt-of-the-zombies\/\">Amara<\/a>.<\/p>\n\n<p>I give this uninspiring melodrama 2 supernatural war crimes out of a possible 5!<\/p>\n\n<div class=\"zombie-stars two-of-five\">2 \/ 5<\/div>\n",
    "title": "Let's Watch: Revolt of the Zombies - hollsk.co.uk",
    "layout": {
        "template": "post"
    },
    "blog": {
        "recent": [
            {
                "title": "Let's Watch: White Zombie",
                "date": "2017-05-07 14:20:00",
                "excerpt": null,
                "description": "Two things I enjoy are folklore and zombies. Oddly in spite of the latter I've never been much of a movie fan; being deaf means I'm obliged to use subtitles and since I'm reading anyway, why not just read a book? But I am interested in the origins of the zombies we know and love today, so since it's Zombie Awareness Month, I've decided to embark on a journey of cinematic discovery, if you will, a zomboddysey, of the zombie canon in cinematic history. So let's watch White Zombie!",
                "slug": "lets-watch-white-zombie"
            },
            {
                "title": "Using actions in Pa11y",
                "date": "2017-03-12 14:20:00",
                "excerpt": null,
                "description": "We recently released Actions for Pa11y and Pa11y Dashboard. This post explores the reasons behind the change, and how to put it to use in your projects right now. ",
                "slug": "using-actions-in-pa11y"
            },
            {
                "title": "On being a deaf developer and deep accessibility",
                "date": "2016-01-18 13:40",
                "excerpt": "&ldquo;The power of the Web is in its universality. Access by everyone regardless of disability is an essential aspect.&rdquo;  - Tim Berners-Lee, inventor of the World Wide Web",
                "description": "Accessibility as a philosophy of problem-solving for everyone",
                "slug": "being-a-deaf-developer"
            },
            {
                "title": "Setting up Vagrant boxes for web development",
                "date": "2014-02-27 00:00",
                "excerpt": null,
                "description": null,
                "slug": "setting-up-vagrant-boxes-for-web-development"
            },
            {
                "title": "Why I switched to Susy",
                "date": "2013-04-13 15:57:41",
                "excerpt": null,
                "description": "Tl;dr: because everything else pretty much sucks",
                "slug": "why-i-switched-to-susy"
            },
            {
                "title": "The London Classic 2013",
                "date": "2013-04-08 15:40:21",
                "excerpt": null,
                "description": "The Heaven of the South",
                "slug": "the-london-classic-2013"
            }
        ]
    }
}