{
    "filepath": "\/Users\/bothwell\/Dev\/websites\/hollsk-data\/raw\/2012-06-28-london-bletchley-23-06-2012.md",
    "filecreated": "2012-06-28",
    "metadata": {
        "title": "London - Bletchley 23\/06\/2012",
        "date": "2012-06-28 02:35:30",
        "lastmod": "2016-08-12 00:00",
        "disqus_identifier": "18"
    },
    "slug": "london-bletchley-23-06-2012",
    "content": "<p>For the 100th anniversary of the birth of Alan Turing, it seemed fitting to do a ride to mark his life and achievements. Turing himself was a cyclist, and while his beloved bike with the chain that would fall off after a regular number of turns doesn't seem to have survived, it seems obvious that it'd have been a single speed. It was authentic, then, for us to complete the journey also running fixed or single speed.<\/p>\n\n<p>We met up at Turing's birthplace in Warwick street, London, in the Little Venice area, just across from Paddington. The ride was split into two groups - one slow group, mostly fixed\/single speed, and one fast group running on gears. Had Turing been joining in with us, he'd probably have joined the fast group - he was a strong and competent cyclist as well as a world-class marathon runner, who had been said to run between London and Bletchley during the war and who tried out for the British marathon team for the 1948 Olympics. Were he alive today he'd certainly be the sort of stats dork to list every single ride on Strava and spend hours fiddling with his tyre pressure and bike weight looking for optimal speed gains. Cycling appeals to maths dorks, and Turing would have been right at home in the dorky geared group with the other lycra warriors.<\/p>\n\n<p>I am not a lycra warrior and I don't have a blingy crabon bike. I'm too fat for the former and I spend too much money at cake stops for the latter. I meet the rest of the slow crowd at Warwick Street at 8:30am - a good bunch, some I'd already met, some I hadn't. As we wait for others to arrive, fiddling with our bikes and chatting, a chap comes over to find out what's going on and why we're all loitering outside Alan Turing's house at 8am. We tell him what we're up to and he looks impressed, wishes us luck, and hopes the weather holds up.<\/p>\n\n<p>The fast crew won't be meeting up until 9:30, so we don't wait for them - they'll catch us up later in any case. After several days of rain and clouds, the sun is out with a vengeance and it occurs to me that I've forgotten to apply sunscreen yet again. I resign myself to the inevitable ferocious sunburn and pedal on.<\/p>\n\n<p>Prior to the ride, there was a lot of talk of constant uphills, horrible winds, terrible gear compromises and all sorts of dark mutterings that made the ride seem like it was going to be a journey through the Alps in winter. I'd expressed my reservations about this kind of activity but was assured that it was all macho nonsense and that it was a lovely ride, really, and that I'd enjoy it. We start off with a lengthy knee-trembler up Wellington Road, a 1.1 mile climb at 5% gradient. Strava notes that this is a category 4 climb, but its relatively low gradient belies its categorisation. But you discover that 1.1 miles of climbing is long. Looooong. By the time we get to the area around Parliament Hill I am cursing the gods and the sadists who had reassured me that the terrain was merely \"rolling\". Grinding my way up Heath Street at 4mph on 42\/16 with the sweat pouring down my face, I am passed by every single member of the slow group, some of whom not only have enough energy for a cheery wave as they pass, but who also apparently want to engage me in conversation! My handlebars begin to creak. I ignore them. Every street seems to be called Something-or-other Hill. We climb something called Bittacy Hill which is surely a joke as there is nothing \"bit\"-like about it.<\/p>\n\n<p>Soon, though, the hills level out into manageable bumps, and my heart rate slows, my legs shut up, and I begin to enjoy myself. There are cycle trainers in our group - I haven't yet been for cycle training but have spent a lot of time reading about it in an effort to improve my own roadcraft. Actually riding with real live cycle trainers shows what a crap tactic that is, particularly in terms of conflict management - it's the first time I've ever seen a well-attended ride roll for pretty much the whole distance without any drivers becoming aggressive in the face of proper assertive road positioning. I'd always thought my communication and negotiation with drivers was pretty good, but riding with the trainers demonstrated how it could be so much better.<\/p>\n\n<p>Around 20 miles in, it's decided that it's time to stop for a coffee. This is not something I'm used to, being of the school that says you should only stop at the halfway point, and even then only if you're desperate. We head along a quiet backstreet in St Alban's and come across a small cafe called Bellacino's. Stacking our bikes up along the wall opposite, we appropriate the entirety of the tables outside and order coffee. The owner, Salim, one-ups us by giving us not only our coffee, but a giant plate of free fruit!<\/p>\n\n<p>Setting off again, we amble through St Alban's and suddenly become aware of shouting. Looking back, we see a couple of lycra-clad blurs zooming past with raised middle fingers. The fast group has caught us up! We're not able to catch up with them to take them to task for their rudeness, so we just carry on our slow and steady pace. We cross the M1 and give the drivers a wave. None of them wave back. We were very far away, though. From Church End to Clement's End, it's all tunnels of trees and virtually carless swooping lanes. We're caught up by the remainder of the fast group that couldn't hold onto the front of the train, and are left behind by them, too.<\/p>\n\n<p>There's the odd terrifying descent along these lanes but no real climbs to speak of until we turn a corner at Clement's End and find Byslips Road, another category 4 climb of 15.5% over half a mile winding upwards towards Studham. The climb is mercifully embedded in woodlands and has a gentle winding turn, making it impossible to see the top and leaving you with the hope that the summit will be around the next corner. The lack of traffic makes it feel much easier than the earlier climbs, and we power our way to the top.<\/p>\n\n<p>At Lower End we cross the A505&#46; It's clouded over now and big fat raindrops start to fall. I'm secretly glad - the sunburn was setting in and the rain is just what I need to cool it down. The rain stops after about 5 yards, which is probably divine retribution for all the mean things I said while climbing those hills at the start. We stop for another break at a crossroads with some flowers and grass and a farm. A huge peloton of roadies goes past and we give them a wave. They're hotly pursued by a solitary rider who goes the opposite way. We point out he's taken a wrong turn but it turns out he's not actually with the others and is probably baffled as to why a bunch of total strangers are telling him what route he's supposed to be taking on his own Saturday training run.<\/p>\n\n<p>The ride into Bletchley is pleasantly uneventful. We roll up to the Eight Belles pub at around quarter past one and meet the two groups of fast riders who have been waiting there for us long enough for a 3 pint lunch. The landlord suggests taking the train next time, but it's Turing's birthday after all, and if we consider What Would Turing Do, we can almost imagine him sitting there with us discussing power wattage and cadence over the route. Somebody would probably even have fixed his chain for him.<\/p>\n",
    "title": "London - Bletchley 23\/06\/2012 - hollsk.co.uk",
    "layout": {
        "template": "post"
    },
    "blog": {
        "recent": [
            {
                "title": "On being a deaf developer and deep accessibility",
                "date": "2016-01-18 13:40",
                "excerpt": "&ldquo;The power of the Web is in its universality. Access by everyone regardless of disability is an essential aspect.&rdquo;  - Tim Berners-Lee, inventor of the World Wide Web",
                "description": "Accessibility as a philosophy of problem-solving for everyone",
                "slug": "being-a-deaf-developer"
            },
            {
                "title": "Setting up Vagrant boxes for web development",
                "date": "2014-02-27 00:00",
                "excerpt": null,
                "description": null,
                "slug": "setting-up-vagrant-boxes-for-web-development"
            },
            {
                "title": "Why I switched to Susy",
                "date": "2013-04-13 15:57:41",
                "excerpt": null,
                "description": "Tl;dr: because everything else pretty much sucks",
                "slug": "why-i-switched-to-susy"
            },
            {
                "title": "The London Classic 2013",
                "date": "2013-04-08 15:40:21",
                "excerpt": null,
                "description": "The Heaven of the South",
                "slug": "the-london-classic-2013"
            },
            {
                "title": "London - Bletchley 23\/06\/2012",
                "date": "2012-06-28 02:35:30",
                "excerpt": null,
                "description": null,
                "slug": "london-bletchley-23-06-2012"
            },
            {
                "title": "What if there's no JSON support on your server?",
                "date": "2012-04-11 09:52:39",
                "excerpt": null,
                "description": "An unlikely situation",
                "slug": "what-if-theres-no-json-support-on-your-server"
            }
        ]
    }
}