{
    "filecreated": "2013-04-08",
    "metadata": {
        "title": "The London Classic 2013",
        "description": "The Heaven of the South",
        "date": "2013-04-08 15:40:21",
        "lastmod": "2016-08-12 00:00",
        "disqus_identifier": "20"
    },
    "slug": "the-london-classic-2013",
    "content": "<p>\"Sunshine is guaranteed for this ride. FACT.\"<\/p>\n\n<p>Three days before the 2013 London Classic, it was snowing. Actual snow! Glumly staring out of the window I reflected on the calendar choice and wondered who would reimburse me for the lack of solar activity. On the morning of the event, I pulled on my arm warmers and set off to the Gipsy Hill tavern in the frost.<\/p>\n\n<p><img src=\"http:\/\/hollsk.co.uk\/hollsk\/images\/uploads\/riders.jpg\" alt=\"Riders at the London Classic\" title=\"\" class=\"align-right space-left standard-margin max-400\" \/> <a href=\"http:\/\/www.thelondonclassic.org\/\">The London Classic<\/a> is probably the best of all the Spring Classics, much better than the rainy Belgian ones or that silly little Paris-Roubaix race of no real consequence. The ride takes you through South London, crosses the river to the north for some investigation down the pavé of London’s winding central streets, leads you over Tower Bridge, then torments you with the finest lung bursting hills that South London has to offer. Entries are limited to 300 and so there is a real sense of camaraderie and high spirits throughout.<\/p>\n\n<p>At the start it was apparent that there was a massive contingent of Brixton Cycles riders and another massive contingent of London Fixed Gear and Single Speed riders, all wearing team kit. Clearly the heat was on. After a lot of dithering about at the start drinking coffee, arguing with each other, and demonstrations of the tardis-like capacity of Bagaboo bags, team LFGSS set off, some time after the Brixton Cycles crew had already gone. Looks like BC win this one, then. Three tandem teams were also joining the ride, mostly with young stokers under the age of ten, who would all go on to do their pilots proud.<\/p>\n\n<p><img src=\"http:\/\/hollsk.co.uk\/hollsk\/images\/uploads\/riding.jpg\" alt=\"On the ride itself\" title=\"\" class=\"align-left space-right standard-margin max-400\" \/> The ride starts off easy - downhill from the Gipsy Tavern and then a short climb up Kingswood Drive to get the legs woken up. From there it’s just a short roll upwards through Brixton and Waterloo to carry us to the pavé segments. One of the volunteers, riding alongside us throughout the day, seemed to be at every pavé section before us, taking pictures of our teeth as they rattled out of our heads and got lost amongst the cobbles. Everybody is in high spirits, and although the peloton spaced out early and separated into mini pelotons, there’s always somebody to ride and chat with. It’s only 30 miles in that things start to look serious, beginning with a haul up Shooter’s Hill to cross Blackheath. The tea hut at Blackheath comes highly recommended, but by the time we get to it we’re already fully committed to the road ahead. The descent of Blackheath Hill on the other side is nerve-wracking fixed, but the worst thing about it is knowing that once you’ve descended, the Honor Oak Park climb is just round the corner, this year taking the place of Pepys Road.<\/p>\n\n<p><img src=\"http:\/\/hollsk.co.uk\/hollsk\/images\/uploads\/canonbie.jpg\" alt=\"Canonbie Road\" title=\"\" class=\"align-right space-left standard-margin max-400\" \/> The piece de resistance this year, as always, was Canonbie Road - a freak of a road that climbs to a proper summit then drops back down like a child’s drawing of a hill. The first section is a slog but tolerable, and you can see the top just ahead so it never feels like it’ll involve much suffering. Unhappily that top section you can see turns out to be not even a false summit, just a corner, and as you take the turn, the gradient increases very suddenly and doesn’t let up until the top. I have never conquered Canonbie Road, fixed or geared. It remains my bête noir. But one day, Canonbie. One of these days I will beat you.<\/p>\n\n<p>Canonbie Road is the hill everybody remembers, but part of what makes it so painful is the second part of the double suckerpunch of Elliot Bank immediately afterwards. Descending Honor Oak Road quickly you need to slow right down to turn left into Elliot Bank, or if you’re really unlucky, stop completely to let traffic come out. Elliot Bank is a winding road shaded by trees like an Alpine climb in miniature form. After the strength-sapping effort of Canonbie, Elliot Bank makes a pedestrian out of many a cyclist, as the climb to the top of Sydenham Hill is crammed into the side of the hill and leads to an unmetalled road at the top filled with holes, bricks, loose stones, and raised ironworks.<\/p>\n\n<p>The descent of Kirkdale from Elliot Road was too much for me to resist, and with a gorgeous clear road ahead, I got my chin down on the stem and concentrated on pure speed, missing the turn sign telling me to turn and tackle new berg Wells Park Road. I later found out that two cyclists who had been following me were trying to catch up to tell me I’d missed the turn but I was “too fast” - the only time anybody has ever said such a thing about me and probably one of the last times. There are some benefits to having a bastard heavy bike. At the bottom of Kirkdale with no signs or cyclists to be seen, I checked my route sheet and realised I’d have to go all the way back up Sydenham Hill to get back on track. Damnit. Rejoining the route at Crystal Palace Park Road and foregoing Wells Park Road entirely, I moved on to Fox Hill, the second of the two newest bergs. This had already been described as “infamous” so I knew I was in for a treat. Ramping up to 20% in places and lined with trees, Fox Hill is a nasty little addition that forced me off my bike almost immediately.<\/p>\n\n<p><img src=\"http:\/\/hollsk.co.uk\/hollsk\/images\/uploads\/tavern.jpg\" alt=\"Back at the Gipsy Hill Tavern\" title=\"\" class=\"align-left space-right standard-margin max-400\" \/> From the top it’s downhill all the way to the finish, again at the Gipsy Tavern, where Fabian Cancellara was dominating Paris-Roubaix on the big screen, his Hell of the North providing a counterpoint to our Heaven of the South. Several pints of Guinness, plate after plate of chicken, rice and peas, lots of raffle prizes, a huge amount of laughter and enjoyment, and one excited dog later, the London Classic was over. As always the hospitality of the hosts and the care and expertise of the organisers and volunteers made for a superb day out for everybody.<\/p>\n\n<p>As for the sunshine that was guaranteed; I even have the sunburn to prove it really happened.<\/p>\n\n<iframe height=\"405\" width=\"100%\" frameborder=\"0\" allowtransparency=\"true\" scrolling=\"no\" src=\"http:\/\/app.strava.com\/activities\/47883704\/embed\/72ab648ae7507c3d6eb443b14b8252c44eb49702\"><\/iframe>\n",
    "title": "The London Classic 2013 - hollsk.co.uk",
    "layout": {
        "template": "post"
    },
    "blog": {
        "recent": [
            {
                "title": "On being a deaf developer and deep accessibility",
                "date": "2016-01-18 13:40",
                "excerpt": "&ldquo;The power of the Web is in its universality. Access by everyone regardless of disability is an essential aspect.&rdquo;  - Tim Berners-Lee, inventor of the World Wide Web",
                "description": "Accessibility as a philosophy of problem-solving for everyone",
                "slug": "being-a-deaf-developer"
            },
            {
                "title": "Setting up Vagrant boxes for web development",
                "date": "2014-02-27 00:00",
                "excerpt": null,
                "description": null,
                "slug": "setting-up-vagrant-boxes-for-web-development"
            },
            {
                "title": "Why I switched to Susy",
                "date": "2013-04-13 15:57:41",
                "excerpt": null,
                "description": "Tl;dr: because everything else pretty much sucks",
                "slug": "why-i-switched-to-susy"
            },
            {
                "title": "The London Classic 2013",
                "date": "2013-04-08 15:40:21",
                "excerpt": null,
                "description": "The Heaven of the South",
                "slug": "the-london-classic-2013"
            },
            {
                "title": "London - Bletchley 23\/06\/2012",
                "date": "2012-06-28 02:35:30",
                "excerpt": null,
                "description": null,
                "slug": "london-bletchley-23-06-2012"
            },
            {
                "title": "What if there's no JSON support on your server?",
                "date": "2012-04-11 09:52:39",
                "excerpt": null,
                "description": "An unlikely situation",
                "slug": "what-if-theres-no-json-support-on-your-server"
            }
        ]
    }
}