{
    "filepath": "\/var\/www\/hollsk-webservice\/web\/data\/raw\/2009-08-26-yeah-net-and-the-deluge-of-spam.md",
    "filecreated": "2009-08-26",
    "metadata": {
        "title": "yeah.net and the deluge of spam",
        "description": "\"The purpose of this post is to introduce our working ability to you\"",
        "date": "2009-08-26 04:39:11",
        "lastmod": "2016-08-12 00:00",
        "disqus_identifier": "8"
    },
    "slug": "yeah-net-and-the-deluge-of-spam",
    "content": "<div class=\"bs-callout bs-callout-warning\">\n<h2>Warning:<\/h2>\n<p>As of November 2013, this post is <strong>4 years old<\/strong>. There have been changes at Netease and Yeah.net in the years between this update and the original composition of the post. These changes mean that the information in the post can no longer be considered current, nor can it be considered useful advice. The post remains as-is below for archival and historical reasons only.<\/p>\n<p>As per the discussion in the comments section in November 2013, I'm amending this advice to suggest that you add all yeah.net domains to your spam blacklists. Do not attempt to engage the owners nor the registrar in discussion; do not reply to any emails you receive from the domain, do not click on any 'unsubscribe' links, and do not attempt to report spam to yeah.net, netease, or markmonitor.com. Report any emails you do receive to your ISP or to your mail provider so that they may add the domain to their own blacklists.<\/p>\n<p>All content below this warning is from the original post which remains in its unaltered form.<\/p>\n<\/div>\n\n<p>Lots of people seem to be confused about the recent shower of spam from @yeah.net addresses.<\/p>\n\n<p>For the uninitiated, over the last couple of days we've been sent the following email repeatedly:<\/p>\n\n<pre><code>We are a China based web designing and development studio. \nThe purpose of this letter is to introduce our working ability to you, we have well \nexperienced professionals in many Web platforms Such as Flash designs , Flash \nAction Scripts , DNN Skinning, PHP,ASP.Net, Flash , HTML , Photoshop, Web \ndesigns , Java scripts, Portal developments MY SQL, MS SQL etc ... Our technical, \ndesign and development team have grown in size to ensure we can continue \nproviding excellent service to all of our customers.\n\nCore offerings\n\nBusiness website design\nBusiness website redesign\nFlash website design\nFlash website redesign\nEcommerce website design\nEcommerce website redesign\nCompany website design\nCompany catalog design\nCompany logo design\nGraphic design\nGoogle search engine optimization\nERP Solutions\n\nPls check our website to see portfolio.\n\nBest regards,\nWallace\nWonassh Information Technologies\nWebsite Team\nContact: dontechit@yeah.net\n\nSend address to websprsou@yeah.net for remove\n<\/code><\/pre>\n\n<p>According to far braver chaps than me, all emails to the unsubscribe address are ignored. Quite why a speculative job letter would reasonably have a mailing list that you could choose to unsubscribe from is beyond me, but I guess the internet is improbably still full of people who trust other people. :\/<\/p>\n\n<p>yeah.net is unconnected with the spammers in the same way that Google's Gmail service is unconnected with the many 419 messages I get annually - it's just a free email service that people are using as a vector for sending spam through. Several commentators seem convinced that yeah.net itself is the culprit, which would seem not to be the case. yeah.net is an affiliated email provider of <a href=\"http:\/\/www.163.com\/\">Netease<\/a>, a Chinese-language internet company providing search engine, email, news aggregation and online games, I guess the Chinese equivalent of Yahoo.<\/p>\n\n<p>Should any of you crazy kids wish to complain about the spam originating from yeah.net domains, I suggest you use the <a href=\"http:\/\/corp.163.com\/eng\/contactus.html\">Netease contact page<\/a> (it's in English, don't panic) and drop the guys there a friendly note to let them know which email addresses are being used for the abuse.<\/p>\n\n<p>PS: 'Wonassh Information Technologies' returns zero hits in good old Google. I had a go with Netease's search engine as well and also got no hits, so either the company name is usually written in Chinese and I'm not able to transcribe it into the right format, or -gasp! It's not actually a real company in the first place and perhaps it's just a front for email harvesting. Blimey.<\/p>\n",
    "title": "yeah.net and the deluge of spam - hollsk.co.uk",
    "layout": {
        "template": "post"
    },
    "blog": {
        "recent": [
            {
                "title": "Setting up Vagrant boxes for web development",
                "date": "2014-02-27 00:00",
                "excerpt": null,
                "description": null,
                "slug": "setting-up-vagrant-boxes-for-web-development"
            },
            {
                "title": "Why I switched to Susy",
                "date": "2013-04-13 15:57:41",
                "excerpt": null,
                "description": "Tl;dr: because everything else pretty much sucks",
                "slug": "why-i-switched-to-susy"
            },
            {
                "title": "The London Classic 2013",
                "date": "2013-04-08 15:40:21",
                "excerpt": null,
                "description": "The Heaven of the South",
                "slug": "the-london-classic-2013"
            },
            {
                "title": "London - Bletchley 23\/06\/2012",
                "date": "2012-06-28 02:35:30",
                "excerpt": null,
                "description": null,
                "slug": "london-bletchley-23-06-2012"
            },
            {
                "title": "What if there's no JSON support on your server?",
                "date": "2012-04-11 09:52:39",
                "excerpt": null,
                "description": "An unlikely situation",
                "slug": "what-if-theres-no-json-support-on-your-server"
            },
            {
                "title": "Bicycle maintenance: n00b mistakes part 1 - threadless headsets",
                "date": "2011-11-11 13:52:54",
                "excerpt": null,
                "description": "Ruin your bike in 1 easy step",
                "slug": "bicycle-maintenance-n00b-mistakes-part-1-threadless-headsets"
            }
        ]
    }
}